fcpptxl/ATMEGA48-IR-Transmission/emit/ir.c
/*********头文件包含*************/
#include <iom48v.h>
#include <macros.h>
#include <stdio.h>
#include "config.h"
#include "HWFS.h"
#include "suma.h"
/***********宏定义*************/
#define  uchar unsigned char 
#define  uint unsigned int
void Delayus(uint US);
void port_init(void);
void Delay_ms (uint ms);
void init_devices(void);
uint mega48_ad(void);
unsigned int ada,k1,tempvalue=0;
/*******************************************
函数名称: Delayus
功    能: 延时指定微秒（8M晶振）
参    数: US--延时的微秒数(大约，不是很精确，MS越大越准确)
返回值  : 无
/********************************************/
void Delayus(uint US)		  
{
 int i;
 US=US*5/4;		  	 //5/4是在8MHz晶振下，通过软件仿真反复实验得到的数值
 for( i=0;i<US;i++); 
}

/*******************************************
函数名称: IO口初始化函数
功    能: 实现IO初始化
参    数: 无
返 回 值: 无
/********************************************/
void port_init(void)
{
 DDRC  = 0x0E;  //PC0作为AD的输入
 PORTC = 0x0E;
DDRD  = 0xFF;
 PORTD = 0x00;
DDRB=BIT(0);
PORTB&=~BIT(0);
}
/*******************************************
函数名称: 软件延时函数
功    能: 实现软件延时
参    数: ms--延时的毫秒数
返 回 值: 无
/********************************************/
extern void Delay_ms (uint ms)
{
 	 unsigned int i,j;
	 for(i=0;i<ms;i++)
	 	for(j=0;j<1141;j++);
}

/*******************************************
函数名称: 设备初始化函数
功    能: 对AVR单片机进行初始化
参    数: 无
返 回 值: 无
/********************************************/
void init_devices(void)
{
 //stop errant interrupts until set up
 CLI(); //disable all interrupts
 port_init();
// timer1_init();

 MCUCR = 0x00;
 EICRA = 0x00; //extended ext ints
 EIMSK = 0x00;
 
 TIMSK0 = 0x00; //timer 0 interrupt sources
 TIMSK1 = 0x00; //timer 1 interrupt sources
 TIMSK2 = 0x00; //timer 2 interrupt sources
 
 PCMSK0 = 0x00; //pin change mask 0 
 PCMSK1 = 0x00; //pin change mask 1 
 PCMSK2 = 0x00; //pin change mask 2
 PCICR = 0x00; //pin change enable 
 PRR = 0x00; //power controller
 SEI(); //re-enable interrupts
 //all peripherals are now initialized
}
/*************************************************************
函数名称: AD采样函数。
功    能: 实现电压的AD采样。
参    数: 无
返 回 值: addata--AD采样的值。1
/************************************************************/
uint mega48_ad(void)
{
     uint addata;
	 ADCSRA = 0x00; //disable adc
	 //PORTA&=~BIT(PA4);
	 ADMUX=0x00;//选择外部参考电压
	 //ADMUX=0xC4;//选择内部参考电压
	 ACSR=0X80;
	 //ADCSRB = 0x00;
	 ADCSRA = 0xC7;
	 while(!(ADCSRA&(BIT(ADIF))));
     addata=ADCL;
	 addata=addata+ADCH*256;
	 //ADCSRA = 0x00;
	 return addata;
}   

/********************************************
函数名称: 主函数
功    能: 实现函数主体功能。
参    数: 无
返 回 值: 无
********************************************/
void main(void)
{
  uint temp_high,temp_middle,temp_low,tempvalue,k2;
  uchar al;
  init_devices();
  while(1)
    {
		k1=0;
		k2=0;
		ada=0;
      		ada=mega48_ad();  //读出AD的采样值
			while(ada<(NTCres[k2]))
			{
			 	k1=k1+2;
				k2++;
				if(k1>410) break;
				tempvalue=k1;
				}
		
		temp_high=tempvalue/100;//十位
		temp_middle=tempvalue%100/10;//个位
		temp_low=tempvalue%10;//小数     x
		al=k2%256;
        hongwaifashe(temp_high,temp_middle,temp_low,al);
	}
}

